lixpaulian/efr32xx-rail/platform/emlib/inc/em_opamp.h
/** Configuration of OPA0 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA0                                             \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeAll,                /* Both main and alternate outputs.        */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                 */ \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.            */ \
    false,                        /* No low pass filter on pos pad.          */ \
    false,                        /* No low pass filter on neg pad.          */ \
    true,                         /* Pass output to next stage (OPA2).       */ \
    true,                         /* Neg pad enabled, used as signal ground. */ \
    true,                         /* Pos pad enabled, used as signal input.  */ \
    false,                        /* No shorting of inputs.                  */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use factory calibrated opamp offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA1                                             \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeAll,                /* Both main and alternate outputs.        */ \
    opaResSelDefault,             /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,           /* Disable resistor ladder.                */ \
    0,                            /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                 */ \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.            */ \
    false,                        /* No low pass filter on pos pad.          */ \
    false,                        /* No low pass filter on neg pad.          */ \
    true,                         /* Pass output to next stage (OPA2).       */ \
    false,                        /* Neg pad disabled.                       */ \
    true,                         /* Pos pad enabled, used as signal input.  */ \
    false,                        /* No shorting of inputs.                  */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use factory calibrated opamp offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in three-opamp differential receiver mode. */
#define OPA_INIT_DIFF_RECEIVER_OPA2                                             \
  {                                                                             \
    opaNegSelResTap,              /* Input from resistor ladder tap.         */ \
    opaPosSelResTapOpa0,          /* Input from OPA0 resistor ladder tap.    */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxOpaIn,             /* Resistor ladder input from OPA1.        */ \
    DAC_OPA0MUX_OUTPEN_OUT0,      /* Enable alternate output 0.              */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                 */ \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.            */ \
    false,                        /* No low pass filter on pos pad.          */ \
    false,                        /* No low pass filter on neg pad.          */ \
    false,                        /* No nextout output enabled.              */ \
    false,                        /* Neg pad disabled.                       */ \
    false,                        /* Pos pad disabled.                       */ \
    false,                        /* No shorting of inputs.                  */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use factory calibrated opamp offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

#elif defined(_SILICON_LABS_32B_SERIES_1)
/** Configuration of OPA in unity gain voltage follower mode. */
#define OPA_INIT_UNITY_GAIN                                                     \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelDefault,             /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,           /* Resistor ladder disabled.               */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA in non-inverting amplifier mode.           */
#define OPA_INIT_NON_INVERTING                                                  \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eq0_33R1,          /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA in inverting amplifier mode. */
#define OPA_INIT_INVERTING                                                      \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA0                                    \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eq0_33R1,          /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA1                                    \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelOpaIn,               /* Pos input from OPA0 output.             */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eq0_33R1,          /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA2                                    \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelOpaIn,               /* Pos input from OPA1 output.             */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eq0_33R1,          /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in cascaded inverting amplifier mode. */
#define OPA_INIT_CASCADED_INVERTING_OPA0                                        \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxNegPad,            /* Resistor ladder input from neg pad.     */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

