lixpaulian/efr32xx-rail/platform/emlib/inc/em_opamp.h
/** Configuration of OPA1 in cascaded inverting amplifier mode. */
#define OPA_INIT_CASCADED_INVERTING_OPA1                                        \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxOpaIn,             /* Resistor ladder input from OPA0.        */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in cascaded inverting amplifier mode. */
#define OPA_INIT_CASCADED_INVERTING_OPA2                                        \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxOpaIn,             /* Resistor ladder input from OPA1.        */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in two-opamp differential driver mode. */
#define OPA_INIT_DIFF_DRIVER_OPA0                                               \
  {                                                                             \
    opaNegSelUnityGain,           /* Unity gain.                             */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelDefault,             /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,           /* Resistor ladder disabled.               */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in two-opamp differential driver mode. */
#define OPA_INIT_DIFF_DRIVER_OPA1                                               \
  {                                                                             \
    opaNegSelResTap,              /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,              /* Pos input from pad.                     */ \
    opaOutModeMain,               /* Main output enabled.                    */ \
    opaResSelR2eqR1,              /* R2 = R1                                 */ \
    opaResInMuxOpaIn,             /* Resistor ladder input from OPA0.        */ \
    0,                            /* No alternate outputs enabled.           */ \
    opaDrvStrDefault,             /* Default opamp operation mode.           */ \
    false,                        /* Disable 3x gain setting.                */ \
    false,                        /* Use full output drive strength.         */ \
    false,                        /* Disable unity-gain bandwidth scaling.   */ \
    false,                        /* Opamp triggered by OPAxEN.              */ \
    opaPrsModeDefault,            /* PRS is not used to trigger opamp.       */ \
    opaPrsSelDefault,             /* PRS is not used to trigger opamp.       */ \
    opaPrsOutDefault,             /* Default PRS output setting.             */ \
    false,                        /* Bus mastering enabled on APORTX.        */ \
    false,                        /* Bus mastering enabled on APORTY.        */ \
    3,                            /* 3us settle time with default DrvStr.    */ \
    0,                            /* No startup delay.                       */ \
    false,                        /* Rail-to-rail input enabled.             */ \
    true,                         /* Use calibrated inverting offset.        */ \
    0,                            /* Opamp offset value (not used).          */ \
    true,                         /* Use calibrated non-inverting offset.    */ \
    0                             /* Opamp offset value (not used).          */ \
  }

